# -*- coding: utf-8 -*-
"""Episode: title
"""
## path
import os
import sys
sys.path.append(os.path.join(os.path.dirname(__file__), '../..'))
sys.path.append('storybuilder')
## local libs
from storybuilder.builder.world import World
from storybuilder.builder.writer import Writer


## define alias
W = Writer
_ = W.getWho()


## scenes
def sc_main(w: World):
    hara, airi, yuri = W(w.harada), W(w.airi), W(w.yuri)
    inside, outside = W(w.inside), W(w.outside)
    wakui = W(w.wakui)
    return w.scene("main",
            hara.do("

　眩しい。
　ということに気づいて、沖愛里は何度か目を瞬かせる。
「ちょっと動かさない。目に入っちゃうよ」
「あ、すみません……」
　ネイビーブルーの長い爪が何度も愛里の視界を横切っていく。それは掴んだ小さな刷毛で、彼女の顔面に色粉を載せていく店のチーママの手だ。ラメ入りのチークで、表情が明るく見えるからと赤江晴美が言いながら最後の仕上げに口紅を塗る。
「ほら、また泣いてる」
　そう言って晴美はティッシュで目元を拭ってくれた。
　よく分からない。
　どうして自分はこんな場所にいるのだろう。
　頭が上手く働かないのだ。
　ただ少し前、それがほんの数分のことなのか、何時間も前のことなのか分からないけれど、涌井祐介に元気の素として細長い錠剤を貰って飲んだ。
　最近色々と考え過ぎていたからか、それを飲むと心がぽかぽかとして余計なことを考えなくて良くなる。それに涌井とのセックスも愉しくなる。以前は仕事をしている時はちっとも楽しそうじゃなく、アパートに帰ってきてはあれこれと愛里に愚痴を言っては慰められていた彼が、今の仕事に就いてからは水を得たカエルのように何とも楽しげに働いている。
　だから愛里も、頑張らなければならない。
　何を？　頑張るの？
「愛里ちゃん？　ほんと、最近よくぼうっとしちゃって。お客さん、新規だけどご指名だそうよ」
「あ、はい。晴美さん、いつもすみません」
　狭い控室だった。
　それでも鏡が貼ってあり、使い回しの化粧品がテーブルの上に積み上げられている。壁際にはひらひらとキラキラのドレスがずらりとハンガーに吊るされ、愛里自身が着ているものも肩と胸元、背中まで大きく開いたドレスだ。コンセプトは海月だとオーナーの白瀬は言っていた。夜の街に漂う海月を見て、疲れた男たちが癒やされるのだと。
　そんな海月の一匹に、愛里はなれているだろうか。
　ストッキングの足に、真っ赤なヒールを合わせる。
　立ち上がると一瞬ふらついたけれど、その手を晴美が掴んで倒れずに済んだ。
「じゃあ、行きましょうか」
「はい。お願いします」


　二人がやっとすれ違える程度の通路を抜けてホールに出ると、薄暗い中をぼんやりとしたライトの水玉がくるりくるりと回りながら照らしていた。並んでいるソファやパーテーション代わりの観葉植物にも少しずつラメ素材の飾りが取り付けられ、それらが反射して夢の国にでもいるような気分になる。
　愛里は晴美について奥の方の四人席に向かった。
　店内は薄暗いながらも結構な人数でそれぞれの席が埋まっていて、時折同僚のキャバクラ嬢の甲高い笑い声が響いていた。
「こちらが当店ナンバースリーの愛里ちゃんです」
「愛里です。まだ入って日が浅いんで至らないところもあると思いますが、愛嬌でがんばります。宜しくお願いします」
　逆光になって相手の顔がよく見えないけれど、構わずに笑顔を作って深々とお辞儀をする。何度もやっていると考えなくても勝手に口や体が動いてくれる。
　涌井の勤めていたカフェでも客から評判の良かった愛里だが、ここでも店員、客問わずに可愛がられていた。
「じゃあ愛里ちゃんはそっちね」
「はい」
　返事は一度だけ、元気よく。
　ここ『Ｓ』は新宿にあるキャバクラの中でも高級店の部類に入るらしい。銀座や六本木にある旗艦店に比べれば接客に対してまだ口うるさくは言われないものの、それでも行儀の悪い女性はすぐに首になっている。
「お邪魔します」
　愛里は言われた通り、ジャケット姿の男性の隣に座る。スリットから腿が露出したが、そうなるように計算されたドレスだからと我慢をする。
「あの」
　アルコールを作ろうと思って何を飲むか尋ねようとしたところで、改めて愛里は自分の相手を見た。
　歳の頃は愛里より五、六歳は上だろう。三十手前くらい、だろうか。優しげな目元だけれど、あまり女性慣れしてなさそうな落ち着きのない目線、それに口元が緊張気味に結ばれていて、手は膝の上でぎゅっと握られている。
　それが、少し震えていた。
「お客さん？」
　愛里は今一度、その男性の顔をまじまじと見やる。
　薬の所為だろうか、少し右のこめかみが痛むが、それを追いやって何とか思い出そうとする。
　よく知っている。
　そう。
　愛里はその頬に、そっと指を伸ばして、触れた。
「なんで！」
　思わず大声を出してしまい、
「愛里ちゃん」
　晴美から窘められる。
　けれど、そんなこと最早どうでも良い。
「何でなのよ！　何で……なんでここにセンセが来るのよ！」
　愛里はその二つの目の奥から湧き出してくる涙を止める術が分からず、溢れるままに涙を流しながら、
「センセ！」
　その首筋に思い切り抱きつく。
　外では何故かパトカーのサイレンがやたらと大きく鳴り響いていた。
            "),
            )


## episode
def ep_main(w: World):
    return w.episode("__episode__",
            ## NOTE
            sc_main(w),
            )
