# -*- coding: utf-8 -*-
"""Episode: title
"""
## path
import os
import sys
sys.path.append(os.path.join(os.path.dirname(__file__), '../..'))
sys.path.append('storybuilder')
## local libs
from storybuilder.builder.world import World
from storybuilder.builder.writer import Writer


## define alias
W = Writer
_ = W.getWho()


## scenes
def sc_main(w: World):
    hara, airi, yuri = W(w.harada), W(w.airi), W(w.yuri)
    inside, outside = W(w.inside), W(w.outside)
    wakui = W(w.wakui)
    return w.scene("main",
            hara.do("

　目の前が真っ暗だった。
　愛里の思考のずっと遠くの方で、パトカーや救急車のサイレンに混ざって原田貴明の声が響いている。
　その声が何て言っているかは分からないが、とても温かく、優しく、必死になって自分に届けようとしてくれている気持ちを感じ取ることができる。
　だから愛里もそれに必死に何かを返そうとするのだが、どんなに頑張って声を出そうとしても吐息すら出てこない。
　その喉を後ろから誰かに掴まれて、ぐいぐいと締め付けられる。
　苦しい。
　お前はまた俺を裏切るのか。
　そんな涌井祐介の声が聞こえる。
「愛里君。こっちに戻ってくるんだ。情やしがらみに流されちゃいけない。君の本当の気持ちを、ちゃんと口にするんだ。そうして、ちゃんと彼と別れるんだ！」
　分かっている。
　それなのにどんどん胸が苦しくなって、どうしようもない。
　愛里は自分の胸を掻き毟ろうとするが、その手すら何かに絡め取られて動けなくなる。
　そのまま涌井祐介の手が自分の乳房を後ろから鷲掴みにして揉みしだく。
　甘い感覚が全身に広がっていく。
　また何も考えられなくなる。
　それなのに、原田の声だけはずっと聴こえていた。
　届いていた。
　あんなに遠いと思っていた彼の声が、今はとても近い。
「……センセ」
　涙が流れ落ちたら、それが声になった。
「センセ。アタシ……やっぱセンセが良い。センセと一緒にいたい。センセと笑って、センセと泣いて、センセと……セックスしたい。したいよ……」
　目の前が光の涙で一杯になり、それはどんどん広がって愛里の全てを包み込んでいく。
　温かく、とても心地よい。
　羽毛に包まれた雛鳥は、こんな気持ちなんだろうか。
　愛里は胎児のように丸まって、静かに眠りに落ちた。


　夢。
　だと思う。
　涌井祐介に振られたことも、失恋して悲しんでいた時に女性アレルギィの恋愛小説家に出会ったことも、彼に本気の恋をして、彼から恋愛を教わって、苦しい気持ちが恋愛の正体だと知ったことも、何もかもが、夢だと思っていた。
　目を開いて最初に気づいたのは、消毒薬の臭い。
　それから自分のことを心配して泣いている、桜庭美樹の顔。
「愛里？」
「……うん」
　声を出すことが出来た。
　けれどヒリヒリとして痛みが残る。それに随分とかさついていた。
　自分の左腕には点滴のチューブが繋がっていて、そこを色の付いた液体が流れている。
「原田さんが愛里のことを助けてくれたんだよ？　覚えてる？」
　美樹の縁なし眼鏡の奥が、涙でぐちゃぐちゃに濡れていた。
「原田、さん？」
「愛里の先生だよ。結城貴司先生……覚えてない？」
「記憶がまだ混濁しているみたいだね」
　美樹の背後に立つ白衣の男性が、愛里の顔を覗き込みながらそう言った。
「高正先生。愛里が飲まされていた薬ってそんなに危ないものなんですか？」
　薬。
　真っ白で涌井祐介から貰ったもの。
　目の前が閃くようにして次々と映像が切り替わる。
「現物を見せてもらっていないから分からないが、おそらくＭＤＭＡ系の錠剤を加工したものだと思う。興奮作用と幻覚作用があり、摂取量によっては一晩中踊り続けて死亡するなどといった例もある。だが沖さんの場合はドラッグそのものの量よりもアルコールと合わせて摂取したことによる過剰反応で、精神的な混乱が起こっているようだね」
　何の話をしているのだろう。
　それよりも愛里は喉が乾いて仕方がなかった。
「……み、ず」
「先生。愛里が」
「少しだけなら良いが、点滴もしているし、暫く我慢してもらった方が良いな」
　先生。
　その言葉の響きが、何だかとても愛おしい。
「せんせ……」
「何かね？」
「違う」
　白衣を着ている男性が覗き込むが、それは愛里の求めるものじゃなかった。
　体を起こすと、
「愛里？」
　愛里は腕に刺さっている点滴の針を引き抜く。
「センセ、どこ？」
「鎮静剤の準備だ」
「はい」
　医師が傍にいた看護師に言いつける。
　一人が部屋を出ていき、残ったもう一人はベッドを降りようとする愛里を押さえつける。
「離して！　アタシはセンセに言わなきゃならないことがあるの！」
「沖さん。君はまだ薬とアルコールの作用で混乱している。落ち着くまでここでゆっくり休むんだ」
「センセはどこなのよ！　ねえ美樹。知ってるんでしょ？」
「愛里……」
　自分を求めてくれた彼の許に、早く駆けつけたかった。
　ただそのことだけが、愛里の心を支配していた。
　だから、
「もういい！」
　看護師の顔に張り手をして仰け反らせると、そのままベッドから飛び起きた。
　美樹の両肩に手を置くと、
「ねえ美樹。センセのとこに案内して」
　そう尋ねたが、彼女は医師の方を見やってどうすればいいかの指示を仰ぐ。
「原田君なら治療は終わって、別の部屋で点滴中だ。だから心配しないで君はまず自分のことだけ考えなさい」
　高正医師はややきつい口調でそう言ったが、愛里の耳には「原田」という言葉しか届かなかった。
「センセ！」
　美樹の手を振り切り、高正を突き飛ばして部屋を飛び出す。
　ひらひらと薄い紙製の処置着の下はブラとショーツだけだったが、構わない。
「沖さん！」
　廊下に看護師の声が響いたが、その声に答えて愛里を見たのは優里の担当をしている三井恵利だった。
「愛里ちゃん？」
「ねえ三井さん。センセ……原田貴明さんはどこ？」
「その突き当りの右手の処置室だけど……あ」
　愛里は感謝の言葉も言わず、一目散にその部屋を目指す。
　心の中にはただ原田のことだけを呼ぶ声が響いていた。
　ドアを開け、中に飛び込む。
「センセ！」
　そこには右頬と額に大きなガーゼを貼り付けられ、苦笑を浮かべてこちらを見た原田貴明がベッドに横になって点滴を受けていた。
「センセ！？　どうしたのそれ」
　原田の顔を見て思い切り飛びつこうとした愛里は、その姿を見てやっと我に返る。
「何言ってるんだい？　愛里君がキャバ嬢になんてなるから、僕が乱闘騒ぎに巻き込まれなきゃならなかったんだよ」
「え？　キャバ嬢？」
　眉間の間を押さえる。
　痛みが記憶を上手く引っ張り出してくれなかったけれど、それでもおぼろげに自分が似合わないひらひらとキラキラのドレス姿でお酒を出しては、あれこれと知らないスーツの男性に触られながら笑っている姿を、幾つか見つけることができた。
「夢……じゃなかった？」
「本当にただの夢なら良かったけれどね……でも、元はと言えば涌井祐介のことまで頭が回らなかった僕が悪い」
「祐介が、何したの？」
　そう口から出したものの、徐々に記憶のピースが繋がり始め、愛里は自分がしてしまったことに悪寒がせり上がってくるのを感じた。
「センセ、まさか……アタシを助ける為に？」
　こくり、と原田は首を動かす。
「それ、祐介に殴られたの？」
「彼や、他にも色々と。警察沙汰にもなって、拳銃とかが出てこなかっただけマシだったよ……」
　そう言って原田は笑おうとしたが、口の端が痛むようだ。
「センセ、ごめん……でも」
　それをずっと待っていた。
　頭が上手く働かないような日々の中で、いつか自分を助け出してくれるんじゃないかと、原田のことだけを考えていた。考えようとしていた。
「センセ……」
　点滴の針が刺さっていない方の腕が、目に入った。
　シャツの袖が捲り上げられ、血液を取られたのか、小さなパッチが付けられていた。
　そこにそっと触れる。
「あ……」
　原田は思わず声を上げたが、けれどそれだけだ。
　蕁麻疹は起こらない。
　それに苦しそうにもしない。
「センセ？」
　その腕を取る。
「大丈夫、なの？」
「いつの間にか、治った……のかな？」
　愛里はその言葉に、思い切り原田の上に伸し掛かった。
「センセ！」
　彼は「おい」と声を上げたが、それを退ける素振りはない。
　思い切りその胸元に顔を埋めると、自分がどんな顔をしていようが構わないと、涙を流しながら顔を押し付けた。
            "),
            )


## episode
def ep_main(w: World):
    return w.episode("__episode__",
            ## NOTE
            sc_main(w),
            )
